[
    {
      "authors": ["Thiago Pinheiro", "Danilo Oliveira", "Rubens Matos", "Bruno Silva", "Paulo Pereira", "Carlos Melo", "Felipe Oliveira", "Eduardo Tavares", "Jamilson Dantas", "Paulo Maciel"],
      "title": "The Mercury Environment: A modeling tool for performance and dependability evaluation",
      "url": "https://ebooks.iospress.nl/doi/10.3233/AISE210075",
      "details": "In: Ambient Intelligence and Smart Environments. IOS Press. June, 2021. Amsterdam, Netherlands.",
      "pdf": "assets/publications/pdf/chapters/chapter-mercury-2021.pdf",
      "abstract": "It is important to be able to judge the performance or dependability metrics of a system and often we do so by using abstract models even when the system is in the conceptual phase. Evaluating a system by performing measurements can have a high temporal and/or financial cost, which may not be feasible. Mathematical models can provide estimates about system behavior and we need tools supporting different types of formalisms in order to compute desired metrics. The Mercury tool enables a range of models to be created and evaluated for supporting performance and dependability evaluations, such as reliability block diagrams (RBDs), dynamic RBDs (DRBDs), fault trees (FTs), stochastic Petri nets (SPNs), continuous and discrete-time Markov chains (CTMCs and DTMCs), as well as energy flow models (EFMs). In this paper, we introduce recent enhancements to Mercury, namely new SPN simulators, support to prioritized timed transitions, sensitivity analysis evaluation, several improvements to the usability of the tool, and support to DTMC and FT formalisms."
    },
    {
      "authors": ["Ronierison Maciel", "Jean Araujo", "Carlos Melo", "Paulo Pereira", "Jamilson Dantas", "Paulo Maciel"],
      "title": "Impact evaluation of DDoS and Malware attack using IoT devices",
      "url": "https://www.degruyter.com/document/doi/10.1515/9783110619751-001/html",
      "details": "In: Distributed Denial of Service Attacks. De Gruyter. July, 2021. Berlin, Germany.",
      "pdf": "assets/publications/pdf/chapters/chapter-ddos-degruyter.pdf",
      "abstract": "Distributed denial-of-service (DDoS) attacks deny access to infrastructures of service providers. These attacks can arise anytime, anywhere, and with little or no warning at all. Most of the small and medium businesses (SMBs) are not able to handle a significant outage, which may be fatal for the companies. These attacks generate damage to enterprises due to service provisioning interruption, which increases the chances of financial losses, and the system’s unavailability. Therefore, to overcome these issues, the companies must possess a bandwidth higher than the attacker, redundant components in their infrastructure, regular backups, firewalls, other proactive and reactive mechanisms for threat monitoring. This chapter explores DDoS and Malware attacks that employ the Internet of Things (IoT) devices. Hierarchical modeling is commonly used to evaluate the availability of such systems. This chapter also assesses the DDoS attack impacts and Malware in IoT devices. It was proposed models based on attack trees that produce the system and components behavior to determine the DDoS and Malware attack effects on system availability; still, it was verified metrics of interest as the likelihood of an attack, attacker benefit, feasibility, and pain factor. The attack tree indicators show the impact of the concurrent attacks using vulnerable IoT devices on a computer system, which can cause a system’s downtime. Using the attack tree analysis, we allow planning and improving the system’s availability, maintainability, and reliability. The obtained results show that DDoS attacks orchestrated by IoT devices correlate negatively with Malware and affect the system’s availability and services."
    }
  ]
  